Repository: vgromov/esfwx-gui-wx
Catalog: escomm-gui/locale/escomm-gui.*.po
Languages: ru_ru

source: Details: '%s'
ru_ru: Подробности: '%s'

source: %d bytes received.
ru_ru: получено %d байт.

source: %d bytes sent.
ru_ru: послано %d байт.

source: 1 Stop Bit
ru_ru: 1 стоп бит

source: 1.5 Stop Bits
ru_ru: 1.5 стоп бита

source: 2 Stop Bits
ru_ru: 2 стоп бита

source: A character-buffer overrun has occurred. The next character is lost.
ru_ru: Возникло переполнение буфера. Следующий байт потерян.

source: Actual data size is unexpected for this command.
ru_ru: Полученный размер данных не подходит для этой команды.

source: Advanced
ru_ru: Расширенные

source: An I/O error occurred during communications with the device.
ru_ru: Ошибка ввода-вывода возникла во время коммуникации с устройством.

source: An input buffer overflow has occurred. There is either no room in the input buffer, or a character was received after the end-of-file (EOF) character.
ru_ru: Возникло переполнение входного буфера. Либо размер буфера недостаточен, либо байт был получен после признака EOF.

source: Automatically reset channel on RX timeout
ru_ru: Автоматически сбрасывать канал при истечении времени ожидания RX

source: Baud rate
ru_ru: Скорость

source: Byte size
ru_ru: Размер байта

source: CRC data error.
ru_ru: Ошибка CRC данных.

source: Cancelling boot mode...
ru_ru: Отмена режима загрузчика...

source: Cannot change RX buffer length while channel is active.
ru_ru: Невозможно изменить длину буфера RX при активном канале.

source: Cannot change RX timeout while channel is active.
ru_ru: Невозможно изменить время ожидания RX при активном канале.

source: Cannot change TX buffer length while channel is active.
ru_ru: Невозможно изменить длину буфера TX при активном канале.

source: Cannot change TX timeout while channel is active.
ru_ru: Невозможно изменить время ожидания TX при активном канале.

source: Cannot change baud rate while channel is active.
ru_ru: Невозможно изменить скорость при активном канале.

source: Cannot change data bit length while channel is active.
ru_ru: Невозможно изменить длину данных при активном канале.

source: Cannot change device while channel is active.
ru_ru: Невозможно сменить устройство при активном канале.

source: Cannot change parity while channel is active.
ru_ru: Невозможно сменить четность при активном канале.

source: Cannot change port while channel is active.
ru_ru: Невозможно сменить порт при активном канале.

source: Cannot change stop bits while channel is active.
ru_ru: Невозможно изменить стоп биты при активном канале.

source: Cannot find channel name for label "%s"
ru_ru: Невозможно найти имя канала по описанию '%s'

source: Cannot get OS version in %s, (err=%lx)
ru_ru: Невозможно получить версию ОС в %s, (код=%lx)

source: Cannot not read from %s
ru_ru: Невозможно считать из %s

source: Channel
ru_ru: Канал

source: Channel is not set.
ru_ru: Канал не выбран.

source: Channel name '%s' is not registered
ru_ru: Канал '%s' не зарегистрирован

source: Client address
ru_ru: Адрес клиента

source: Client connection accepted on %d from '%s'
ru_ru: Клиентское соединение принято на порту %d от '%s'

source: Client socket (network) connection channel
ru_ru: Клиентский сетевой коммуникационный канал

source: Client socket channel configuration GUI.
ru_ru: Интерфейс конфигурации клиентского сетевого канала

source: Client socket connection is lost
ru_ru: Соединение с клиентом потеряно

source: Close EKONNECT device channel
ru_ru: Закрыть канал устройства EKONNECT

source: Close client socket channel
ru_ru: Закрыть клиентский сетевой канал

source: Close server socket channel
ru_ru: Закрыть серверный сетевой канал

source: Close uart channel
ru_ru: Закрыть последовательный канал

source: Communication channel configuration
ru_ru: Конфигурация коммуникационного канала

source: Connected device is appliance, not hub.
ru_ru: Подсоединена ИГ, а не БОИ

source: Connected device is hub, not appliance.
ru_ru: Подсоединен БОИ, а не ИГ

source: Connection to '%s:%d' is refused by peer
ru_ru: Соединение с '%s:%d' отклонено удаленным устройством

source: Could not find '%s' entry in FTDI driver.
ru_ru: Метод '%s' не найден в библиотеке драйвера FTDI.

source: Could not set operation timeout while socket is connected
ru_ru: Невозможно установить время ожидания операции при активном сокете

source: Could not set server socket port while server is active
ru_ru: Невозможно установить серверный порт пока сокет активен

source: Could not set target address while socket is connected
ru_ru: Невозможно установить адрес удаленного устройства пока сокет активен

source: Could not set target port while socket is connected
ru_ru: Невозможно установить порт удаленного устройства пока сокет активен

source: Could not use '%d' as target port
ru_ru: Невозможно использовать '%d' в качестве удаленного порта

source: Could not use '%s' as target address
ru_ru: Невозможно использовать '%s' в качестве адреса удаленного устройства

source: Current I/O rate
ru_ru: Текущая скорость ввода-вывода

source: Data size in header does not equal to real data size; data packet may be incomplete.
ru_ru: Размер данных в заголовке не соответствует полученному занчению. Пакет данных, возможно, получен не полностью.

source: Delay after device reboot, ms
ru_ru: Задержка после перезагрузки устройства, мс

source: Device '%s' closed.
ru_ru: Устройство '%s' закрыто.

source: Device EEPROM erase failed
ru_ru: Стирание EEPROM устройства закончилось неудачей

source: Device EEPROM not programmed
ru_ru: EEPROM устройства не запрограмирован

source: Device EEPROM read failed
ru_ru: Чтение EEPROM устройства закончилось ошибкой

source: Device EEPROM write failed
ru_ru: Запись EEPROM устройства закончилось ошибкой

source: Device is not found
ru_ru: Устройство не найдено

source: Device is not open
ru_ru: Устройство не активно

source: Device is not ready.
ru_ru: Устройство не готово.

source: Device name
ru_ru: Имя устройства

source: Device not open for erase
ru_ru: Устройство не готово к стиранию

source: Device not open for write
ru_ru: Устройство не готово к записи

source: Driver input-output error
ru_ru: Ошибка ввода-вывода в драйвере

source: EEPROM not present in device
ru_ru: В устройстве отсутствует EEPROM

source: EKONNECT adapter direct connection channel
ru_ru: Канал прямого соединения через EKONNECT

source: EKONNECT device '%s' opened. Configured for %d baud, %d data bits, %s, %s.
ru_ru: Устройство EKONNECT '%s' активно. Сконфигурировано на %d бод, %d битов данных, %s, %s.

source: Entering boot mode, %d s remaining...
ru_ru: Вход в режим загрузчика, осталось %d сек. ...

source: Error occured while reading from socket: '%s'
ru_ru: Ошибка чтения из сокета: '%s'

source: Error occured while writing to socket: '%s'
ru_ru: Ошибка записи в сокет: '%s'

source: Even
ru_ru: Чет

source: FTDI call error occured. Returned status is '%s'.
ru_ru: Ошибка вызова драйвера FTDI. Статус '%s'.

source: FTDI device driver is not found or not installed on this machine.
ru_ru: Драйвер устройств FTDI не найден или не установлен на этой машине.

source: Failed to write device
ru_ru: Ошибка записи в устройство

source: Generic
ru_ru: Основные

source: Host is not found
ru_ru: Хост не найден

source: Input/Output socket error
ru_ru: Ошибка ввода-вывода сокета

source: Insufficient resources
ru_ru: Не хватает ресурсов

source: Invalid (uninitialized) socket
ru_ru: Неверный (неинициализированный) сокет

source: Invalid arguments
ru_ru: Неверные параметры

source: Invalid baud rate
ru_ru: Неверная скорость

source: Invalid handle
ru_ru: Неверный идентификатор

source: Invalid parameter
ru_ru: Неверный параметр

source: Invalid socket address
ru_ru: Неверный адрес сокета

source: Invalid socket operation
ru_ru: Неверная операция сокета

source: Invalid socket port
ru_ru: Неверный порт сокета

source: Listening for incoming client connections on port %d
ru_ru: Ожидание входящих клиентских соединений на порте %d

source: Mark
ru_ru: Уст. бит

source: No socket error
ru_ru: Ошибки отсутствуют

source: None
ru_ru: Нет

source: Odd
ru_ru: Нечет

source: Open EKONNECT device channel
ru_ru: Открыть канал EKONNECT

source: Open client socket channel
ru_ru: Открыть канал клиентского сокета

source: Open server socket channel
ru_ru: Открыть канал серверного сокета

source: Open uart channel
ru_ru: Открыть последовательный канал

source: Operation not supported
ru_ru: Операция не поддерживается

source: Operation timeout (s)
ru_ru: Время ожидания операции (сек)

source: Packet retries
ru_ru: Повт. пакетов

source: Packet timeout, ms
ru_ru: Время ожидания пакета, мс

source: Parity
ru_ru: Четность

source: Pending data packet is too long.
ru_ru: Текущий пакет данных слишком длинный.

source: Port '%s' closed.
ru_ru: Порт '%s' закрыт.

source: Port '%s' opened. Configured for %d baud, %d data bits, %s, %s.
ru_ru: Порт '%s' открыт. Настроен на %d бод, %d бит данных, %s, %s.

source: Port name
ru_ru: Имя порта

source: Protocol
ru_ru: Протокол

source: RPC Server is inactive.
ru_ru: Сервер RPC не активен.

source: RPC execution was prematurely cancelled due to timeout
ru_ru: Выполнение RPC было преждевременно завершено из-за истечения времени ожидания

source: RPC failed due to communication layer
ru_ru: Ошибка RPC на уровне коммуникации

source: RPC has to many parameters, breaking call to prevent stack overflow
ru_ru: Слишком много параметров RPC. Вызов прерван для предотвращения переполнения стека

source: RPC id of response does not match one of request
ru_ru: ID ответа и запроса вызова RPC не соответствуют друг другу

source: RPC not ready to respond (requested data not ready and|or device is busy)
ru_ru: Подсистема RPC не готова к ответу (запрашиваемые данные не готовы и/или устройство занято)

source: RPC parameter %d value error
ru_ru: Ошибка значения параметра RPC %d

source: RPC signature is unknown
ru_ru: Неизвестная сигнатура RPC

source: RPC signatures of caller and callee do not match
ru_ru: Сигнатуры RPC вызывающей и вызываемой сторон не совпадают

source: RPC stack is corrupt and unusable
ru_ru: Стек RPC поврежден

source: RPC succeeded
ru_ru: Успешный вызов RPC

source: RPC with sig='%s' and id='%d' failed with error: '%s'
ru_ru: Вызов RPC с сигнатурой='%s' и id='%d' завершился с ошибкой: '%s'

source: RPC with this id is not implemented in client
ru_ru: RPC с таким идентификатором не реализована на стороне клиента

source: RS232 direct connection channel
ru_ru: Канал прямого соединения через RS232

source: RX buffer size
ru_ru: Размер буфера RX

source: RX timeout in ms
ru_ru: Время ожидания RX в мс

source: Rate control functionality is not supported in '%s'
ru_ru: Управление скоростью передачи не поддерживается в '%s'

source: Request device programming mode
ru_ru: Запрашивать режим программирования устройства

source: Requested device address is out of range.
ru_ru: Запрашиваемый адрес устройства находится вне допустимого диапазона

source: Requested rate value is not supported.
ru_ru: Запрашиваемое значение скорости не поддерживается

source: Rescan EKONNECT devices
ru_ru: Заново найти устройства EKONNECT

source: Rescan serial ports
ru_ru: Заново найти последовательнве порты

source: Reset EKONNECT device channel IO buffers
ru_ru: Сбросить буферы ввода-вывода устройства EKONNECT

source: Reset channel IO buffers
ru_ru: Сбросить буферы ввода-вывода канала

source: Reset client socket channel IO buffers
ru_ru: Сбросить буферы ввода-вывода клиентского сетевого канала

source: Reset server socket channel IO buffers
ru_ru: Сбросить буферы ввода-вывода серверного сетевого канала

source: Reset to defaults
ru_ru: Сбросить в значения по-умолчанию

source: Select channel:
ru_ru: Выберите канал:

source: Server address
ru_ru: Адрес сервера

source: Server port
ru_ru: Порт сервера

source: Server socket (network) connection channel
ru_ru: Серверный сетевой коммуникационный канал

source: Server socket cannot listen on port %d
ru_ru: Серверный сокет не может принимать соединения на порте %d

source: Set rate query failed
ru_ru: Запрос установки скорости завершился ошибкой

source: Slave address
ru_ru: Адрес ведомого

source: Slave address end value
ru_ru: Конечное значение адреса клиента

source: Slave address start value
ru_ru: Начальное значение адреса клиента

source: Socket memory exhausted
ru_ru: Не хватает памяти для сокета

source: Space
ru_ru: Неуст. бит

source: Stop bits
ru_ru: Стоп биты

source: Stop listening for incoming client connections on port %d
ru_ru: Прекращено ожидание входящих соединений на порте %d

source: Stub Io channel does not have any adjustable settings
ru_ru: Канал-заглушка не имеет никаких настроек

source: Stub channel
ru_ru: Канал-заглушка

source: Success
ru_ru: Успешно

source: Supply power for connected device
ru_ru: Подавать питание для подсоединенного устройства

source: TX buffer size
ru_ru: Размер буфера TX

source: TX timeout in ms
ru_ru: Время ожидания TX в мс

source: The application tried to transmit a character, but the output buffer was full.
ru_ru: Приложение попыталось передать байт, но исходящий буфер полон.

source: The hardware detected a break condition.
ru_ru: Аппаратное обеспечение зарегистрировало разрыв связи.

source: The hardware detected a framing error.
ru_ru: Аппаратное обеспечение зарегистрировало ошибку кадра данных.

source: The hardware detected a parity error.
ru_ru: Аппаратное обеспечение зарегистрировало ошибку четности.

source: The requested mode is not supported, or the file handle is invalid.
ru_ru: Запрашиваемый режим не поддерживается, или идентификатор файла неверен.

source: The socket is non-blocking and the operation would block
ru_ru: Сокет не является блокирующим, в то время, как запрашиваемая операция вызовет блокировку.

source: The timeout for socket operation expired
ru_ru: Время ожидания поерации в сокете истекло

source: Unknown FTDI device error
ru_ru: Неизвестная ошибка устройства FTDI

source: Unknown FTDI status.
ru_ru: Неизвестный статус FTDI.

source: Unknown RPC status
ru_ru: Неизвестный статус RPC

source: Unknown command.
ru_ru: Неизвестная команда.

source: Unknown error %d.
ru_ru: Неизвестная ошибка %d.

source: Unknown signature
ru_ru: Неизвестная сигнатура

source: Unknown socket error
ru_ru: Неизвестная ошибка сокета

source: Use standard RS232 socket
ru_ru: Использовать стандартное гнездо RS232

source: Wrong class name in configuration string. Expected %s, got %s.
ru_ru: Неверное имя класса в конфигурационной строке. Ожидалось %s, получено %s.

source: Wrong data size alignment (not multiple of 2).
ru_ru: Неверное выравнивание размера данных (не кратно 2).

source: Wrong data size. Expected %d bytes, %d bytes received.
ru_ru: Неверный размер данных. Ожидалось %d байт, получено %d байт

source: Wrong data size. Expected %d or %d bytes, got %d bytes
ru_ru: Неверный размер данных. Ожидалось %d или %d байт, получено %d байт.
